# QTOpenMovieFile

## Description
Creates or opens a QuickTime movie file for writing.

```pascal
FUNCTION QTOpenMovieFile(fileName : STRING): INTEGER;
```

```python
def vs.QTOpenMovieFile(fileName):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fileName|STRING|Name of movie file.|

## Version
Availability: from VectorWorks8.5

## Category
* Special - QuickTime